
HEADERS = {
'User-Agent':'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML,like Gecko) Chrome/81.0.4044.92 Safari/537.36',
}

api ='https://gpt-seo.qq588.cc/api/gpt-seo?prompt='
# api_img = 'https://gpt-seo.qq588.cc/api/gpt-img?size=512x512&prompt='
api_img = 'https://gpt-seo.qq588.cc/api/gpt-img?prompt='


industry_list = ["汽車製造業","電子產品製造業","紡織業","冶金業","室內設計業","食品業","塑膠業","印刷業","橡膠業","農業","金融業","營造業","運輸業","人力資源業","電信業","保險業","房地產業","建材業","製藥業","廣告業","旅遊業","娛樂業","科技業","教育業","百貨業","服裝業","媒體業","雜貨業","裝飾業","機械業","樂器業","化妝品業","3C家用電器業","鐘錶類業","酒店業","礦業","出版業","廚具業","電子商務業","醫藥業","航空業","攝影業","清潔業","傢俱業","保健品業","設計業","飲料業","包裝業","運動用品業","棉紡織業","電子游戲業","鋼鐵業","廣播業","玩具業","家畜業","測量業","投資業","資訊業","烘焙業","燃料業","洗滌業","傳播業","汽車租賃業","冷凍業","辦公用品業","拍賣業","畜牧業","模型業","建築業","洗衣業","水產業","燈飾業","餐飲業","家居用品業","資料分析業","印刷品業","園藝業","廢料業","針織業","遊樂業","水泥業","黃金業","照明業","居家裝飾業","廣播電視業","物流業","紙品業","紡織品業","貨運業","藥品業","辦公室業","酒類業","建築裝修業","五金業","環保業","食品加工業","珠寶貴金屬業","包裝紙業","養殖業","玻璃業","技術顧問業","室內裝修業","農產加工業","環境保護業","建築材料業","銷售業","打工人","中小企業", "管理者" ]

# 者如何提升自我相關 ** 能力
can_up = ["自我管理",'溝通','決策','應變','分析思維','組織','計劃和組織','資料分析','商業報表分析','數據分析','市場導向','領導','創新','商務倫理','商業策略','商業報告書寫作','商業簡報, "投資分析','財務管報','商業數據採集','商業報表分析','商業評估','市場潛力分析','價值創造','營銷','資源規劃','全球市場管理','成本管理','風險管理','策略規劃','投資分析','財務管理','商業模式分析','供應鏈管理','品牌管理','高效率工作','專案管理','新產品開發','流程管理','客戶關係管理','全球市場管理','技術文件寫作','語言口條',' 關鍵技術','計算機技能','投資決策','業務開拓','文化素养','法律知識','投資知識','全球性思維','高效率工作']


# 如和做好企業的
how_do_good = ['品牌經營','數據分析','社交媒體行銷','客戶關係管理','行銷自動化','商業分析','電子商務','企業形象','市場調研','行銷策略','產品設計','銷售管理','產品開發','網站設計','銷售技','客戶服務','研究發展','業務拓展','智能化應用','客戶分類','網絡營銷','行業拓展','成本控制','人力資源管理','業務流程','品牌管理','項目管理','商業報告','網絡安全','公關','經營建議','決策分析','技術擴展','創新創業','價值管理','多媒體行銷','收入模式','投資策略','經營模式','人力分配','供應鏈管理','培訓管理','多渠道行銷','行銷評估','價值鏈分析','客戶關係建立','促銷策略','發展戰略','成本管理','標準化管理','國際化策略','經營整合','網絡拓展','內容行銷','業務流程自動','商業優勢','資源整合','顧客滿意度','技術創新','網絡推廣','利潤分析','市場定位','產品推廣','市場拓展','流程標準化','行銷資源整合','市場洞察','經營合作','客戶分析','科技創新','內容管理','資源規劃'] 

# 如何有效提升
sell = ["社群行銷","數據分析","聯盟行銷","融合行銷","網路行銷","社群行銷","網絡营销","SEO","SEM","網絡廣告","電子商務","手機行銷","搜索行銷","社會媒體行銷","網絡推廣","內容行銷","精準行銷","廣告投放"," 自動化行銷","產品行銷","互動行銷","觸媒行銷","推薦系統","社群行銷","多媒體行銷","智能行銷","事件行銷","動態行銷","持續行銷","口碑行銷","互動式行銷","行銷自動化","活動行銷","影音行銷","網路廣告","微信行銷","行銷計劃","行銷分析","肯定行銷","手機廣告","電子郵件行銷"," 聯繫行銷","客戶行銷","指導行銷","多渠道行銷","微博行銷","價格行銷","資訊行銷","品牌行銷","行銷活動","增長行銷","網站行銷","行銷開發","策略行銷","行銷策劃","行銷設計","行銷管理","行銷渠道","現場行銷","跨境行銷","廣告行銷","行銷策略","經銷行銷","移動行銷","品牌公關"]



# 談論有關於 **
feeling = ["自我實現","延遲滿足","自尊","自我效能","自閉症","抑鬱症","憂鬱症","焦慮症","成癮","反社會行為","衝動行為","失眠","躁鬱症","恐懼","噩夢","幻覺","偏執","無助感","身心疲勞","孤獨感","社會不適應","自殺","恐慌","情緒激動","抑制情緒","情緒調節","憂鬱情緒","心理安全感","信任感","憤怒","恐懼","安慰感","愛","互補","憐憫","嫉妒","怨恨","抑鬱","驕傲","觀察力","羞愧","多元思考","絕望","無助","恐慌症","言語行為","假設思維","自私","失望","憎恨","煩惱","失落","自卑","孤立","沮喪","避棄","虛偽","同情","懷疑","怯懦","寂寞"]
#心理學分支
Psychology=['生理心理學','行為心理學','認知心理學','心理測量學','社會心理學','應用心理學','教育心理學','文化心理學','心理學','臨床心理學']

#各大定律效應 談論
mba = ['財務管理定律','貝克定律','經營管理理論','利潤最大化原則','財務管理最大值原則','有效性原則','實物有效性原則','把握市場節奏原則','行業競爭原則','財務整合原則','市場導向原則','消費者行為原則','裁員管理原則','行政管理原則','經營管理原則','企業社會責任原則','投資管理原則','管理績效原則','未來型企業原則','企業組織原則','創新管理原則','管理責任原則','全球化管理原則','企業發展原則','品牌管理原則','社會責任原則','管理質量原則','激勵管理原則','企業戰略原則','管理控制原則','管理決策原則','營銷管理原則','組織行為原則','企業文化原則','服務營銷原則','領導力原則','財務風險管理原則','人力資源管理原則','財務成本管理原則','系統性管理原則','信息管理原則','經營成本管理原則','財務報表原則','組織發展原則','財務流動性原則','企業管治原則','財務報告原則','法律合規原則','經營模式原則','金融服務原則','企業國際化原則','績效考核原則','組織結構原則','財務規劃原則','企業發展戰略原則','財務期望值原則','市場選擇原則','企業經營原則','財務投資原則','財務分析原則','知識管理原則','財務優化原則','預算管理原則','企業發展戰術原則','客戶滿意原則','創新發展原則','財務控制原則','財務估值原則','企業治理原則','經營管理流程原則','財務投資決策原則','財務穩定性原則','財務風險管控原則','全球營銷原則','企業規劃原則','創新績效原則','財務報表分析原則','財務策略原則','管理科學原則','企業績效原則','精益生產理論','多元化策略理論','概率期權理論','貝恩定律','定性分析模型','波特五力分析','橋樑模型','創新曲線','產品生命週期理論','赫爾曼·庫塔定律','霍茲伯格定律','情報定律','解釋性研究','技術迭代','交叉補貼','凱恩斯定律','科學管理理論','空間結構理論','庫特羅定律','流程績效改進模型','羅賓遜定律','馬斯洛需求層次理論','營銷混合理論','期望管理理論','技術發展曲線','社會營銷理論','調查研究','供應鏈管理','實證研究','統計推斷','文化沙漏理論','熵增理論','技術更新曲線','維納斯模型','維納斯定律','維爾森模型','計算機輔助分析','質量費用折衷理論','質量費用均衡理論','質量成本模型','質量成本控制理論','質量週期理論','質量管理思想','自主技術更新','自我實現理論','宗旨管理理論','綜合分析方法','趨勢投資理論','投資組合理論','項目經理角色理論','信息技術視角','信息論','信息論模式','信息論模型','信息系統模型','信號檢測理論','信號處理理論','信號處理模型','信號處理算法','形式語言理論','形式推理理論','形式設計理論','形式推理模型','形態學分析','行業結構理論','行為金融學','行業生命週期理論','行為定律','行為研究','行為管理理論','行動方案理論','行動研究','行動研究方法','洪堡定律','泛化研究','財務風險管理','組織學習理論','組織行為理論','組織行為模型','組織變革理論','組織結構理論','組織文化理論','組織發展理論','組織發展模式','組織認知理論','組織管理理論','組織管理模式','組織營銷理論','組織營銷模式','牛頓第一定律','牛頓第二定律','牛頓第三定律','伽羅瓦定律','假設-推理定律','朗道定律','動量守恆定律','張量分析定律','佩里定律','歐姆定律','卡曼定律','馬太效應','普朗克定律','哥本哈根效應','拉普拉斯定律','經典力學定律','熱力學第一定律','熱力學第二定律','摩擦定律','可再生能源定律','熵定律','馮·諾依曼定律','普朗特定律','布洛赫定律','庫倫定律','哈密頓原理','墨非定律','安慰劑效應','阿什法則','真空管定律','結構力學定律','空氣動力學定律','氣象學定律','拉格朗日機械原理','拉曼散射定律','維納定律','貝爾定律','庫侖定律','克里斯汀定律','費米原理','佩里-曼定律','黑體輻射定律','費曼原理','哈耳定律','幾何光學定律','像差定律','弗蘭克-斯托克斯定律','薛定諤方程','相對論定律','萊布尼茲定律','普朗克定理','費米-約瑟夫定律','費米-維德定律','漢密爾頓定理','恆星演化定律','磁力定律','宇宙學定律','電磁學定律','愛因斯坦相對論','統計力學定律','玻爾定律','量子力學定律','費米-愛因斯坦原理','諧振定律','熱力學第三定律','安慰劑效應','牛頓定律','費米定律','莫爾斯電磁定律','愛因斯坦相對論','夸克定律','能量守恆定律','氣體定律','蒙特卡洛概率定律','物競天擇','弗蘭克定律','摩爾定律','里弗斯定律','柯林斯定律','熱力學第四定律','泊松定律','耶穌定律','斯托克斯定律','謝爾定律','伽瑪定律','克勞德定律','哥德爾定律','矩形定律','普通物理學定律','費米-費米定律','泰勒-費米定律','歐幾里得定理','拉普拉斯定理','空間曲率定理','波爾定理','特拉克定理','代數定理','統計定理','大數定理','哥德巴赫猜想','比較定理','幾何定理','平衡定理','排比定理','孿生定理','中心定理','節律定理','黎曼-希爾伯特定理','梯度定理','馬爾可夫定理','拉斯維加斯定理','木易定理','卡爾曼定理','維特根斯坦定理','古典力學定理','恆星定理','二次函數定理','洛必達定理','佩雷索定理','漸近線定理','庫侖定理','貝爾定理','量子態疊加定理','定調定理','熱平衡定理','康托爾定理','拉格朗日定理','最大最小值定理','拉賓-瓦倫丁斯定理','波爾比定理','均值定理','積分定理','埃爾米特定理','馮·諾依曼定理','古典電磁學定理','默爾定理','可解性定理','極限定理','累乘定理','拋物線定理','節點定理','極坐標定理','對稱定理','羅賓遜定理','雅可比定理','完全拆分定理','特徵根定理','變址定理','唯一分解定理','布拉格定理','高斯定理','抗幾何變換定理']

