
HEADERS = {
'User-Agent':'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML,like Gecko) Chrome/81.0.4044.92 Safari/537.36',
}



industry_list = ["腰子牛A級","腹脊牛A級","肋眼牛A級","腿肉牛A級","腿腱牛A級","肩胛牛A級","腱子牛A級","蝴蝶牛A級","腹肉牛A級","肩肉牛A級","和牛A級","骰子牛A級","里脊牛A級","粒粒牛A級","腹膜牛A級","腱肉牛A級","腿膜牛A級","腱膜牛A級","肩膜牛A級","腰膜牛A級","腹腱牛A級","霜降牛A級","腰子牛B級","腹脊牛B級","肋眼牛B級","腿肉牛B級","腿腱牛B級","肩胛牛B級","腱子牛B級","蝴蝶牛B級","腹肉牛B級","肩肉牛B級","和牛B級","骰子牛B級","里脊牛B級","粒粒牛B級","腹膜牛B級","腱肉牛B級","腿膜牛B級","腱膜牛B級","肩膜牛B級","腰膜牛B級","腹腱牛B級","霜降牛B級","腰子牛C級","菲力牛","肋眼牛C級","腿肉牛C級","腿腱牛C級","肩胛牛C級","腱子牛C級","熊本和王","腹肉牛C級","紐約客","和牛C級","嫩肩部位","里脊牛C級","粒粒牛C級","腹膜牛C級","腱肉牛C級","牛五花","翼板牛","肩膜牛C級","雪花牛","腹腱牛C級","霜降牛C級",'牛肉小排','澳洲A4和牛','松阪豬','日本A5和牛','牛小排','霜降牛','牛肉片','美國A5和牛','牛腱子','澳洲A5和牛','牛肋排','牛腩','牛腸','牛肉燥','澳洲A4和牛','牛肋骨','牛里脊','牛腩排','牛肋腩','牛腩條','牛肋腸','牛腱條','牛腰子','牛肉粒','牛肋條','牛肉醬','牛肝','牛肝脯', '牛腱子肉', '牛舌', '牛腰花', '牛心',]


